In [3]:
import pandas as pd
dataset=pd.read_csv('/Users/jayraj/Applied_AI_Course/Applied_ai_course/Datasets/weather_data.csv')
dataset

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [4]:
# creation of dataframe using tuples and code-pd.DataFrame('filename',columns=['col1','col2'....])
jerry_data=[(1,2,2),
           (2,2,4),
           (3,2,3)]
dataframe=pd.DataFrame(jerry_data,columns=['day','hours of study','hours of entertainment'])
dataframe

   day  hours of study  hours of entertainment
0    1               2                       2
1    2               2                       4
2    3               2                       3

In [5]:
# to check first few rows:

dataset.head()

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain

In [6]:
# to check last few rows:

dataset.tail()

        day  temperature  windspeed  event
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [7]:
# to check the number of rows and columns:

dataset.shape

(6, 4)

In [8]:
dataset.day

0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
4    1/5/2017
5    1/6/2017
Name: day, dtype: object

In [18]:
import datetime as dt
dataset['day']=pd.to_datetime(dataset['day'])

dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   day          6 non-null      datetime64[ns]
 1   temperature  6 non-null      int64
 2   windspeed    6 non-null      int64
 3   event        6 non-null      object
dtypes: datetime64[ns](1), int64(2), object(1)
memory usage: 320.0+ bytes

In [10]:
dataset.temperature

0    32
1    35
2    28
3    24
4    32
5    31
Name: temperature, dtype: int64

In [19]:
# filtering out the days having windspeed maximum

dataset.day[dataset.windspeed==dataset.windspeed.max()]

1   2017-01-02
3   2017-01-04
Name: day, dtype: datetime64[ns]

In [20]:
dataset.day[dataset.temperature==dataset.temperature.min()]

3   2017-01-04
Name: day, dtype: datetime64[ns]

In [21]:
dataset.describe()

       temperature  windspeed
count     6.000000   6.000000
mean     30.333333   4.666667
std       3.829708   2.338090
min      24.000000   2.000000
25%      28.750000   2.500000
50%      31.500000   5.000000
75%      32.000000   6.750000
max      35.000000   7.000000

In [22]:
# acessing particular rows in a dataframe. It excludes the end row
dataset[0:4]

         day  temperature  windspeed  event
0 2017-01-01           32          6   Rain
1 2017-01-02           35          7  Sunny
2 2017-01-03           28          2   Snow
3 2017-01-04           24          7   Snow

In [24]:
dataframe=pd.read_excel('/Users/jayraj/Applied_AI_Course/Applied_ai_course/Datasets/weather_data_cities.xlsx')
dataframe

          day      city  temperature  windspeed   event
0  2017-01-01  new york         32.0        6.0    Rain
1  2017-01-02  new york         36.0        7.0   Sunny
2  2017-01-03  new york         28.0       12.0    Snow
3  2017-01-04  new york         33.0        7.0   Sunny
4  2017-01-01    mumbai         90.0        5.0   Sunny
5  2017-01-02    mumbai         85.0       12.0     Fog
6  2017-01-03    mumbai         87.0       15.0     Fog
7  2017-01-04    mumbai         92.0        5.0    Rain
8  2017-01-01     paris         45.0       20.0   Sunny
9  2017-01-02     paris         50.0       13.0  Cloudy
10 2017-01-03     paris         54.0        8.0  Cloudy
11 2017-01-04     paris         42.0       10.0  Cloudy

In [25]:
# to save the current dataframe to another name
dataframe.to_csv("dataframe1.csv")

dataframe1=pd.read_csv('dataframe1.csv')
dataframe1

    Unnamed: 0         day      city  temperature  windspeed   event
0            0  2017-01-01  new york         32.0        6.0    Rain
1            1  2017-01-02  new york         36.0        7.0   Sunny
2            2  2017-01-03  new york         28.0       12.0    Snow
3            3  2017-01-04  new york         33.0        7.0   Sunny
4            4  2017-01-01    mumbai         90.0        5.0   Sunny
5            5  2017-01-02    mumbai         85.0       12.0     Fog
6            6  2017-01-03    mumbai         87.0       15.0     Fog
7            7  2017-01-04    mumbai         92.0        5.0    Rain
8            8  2017-01-01     paris         45.0       20.0   Sunny
9            9  2017-01-02     paris         50.0       13.0  Cloudy
10          10  2017-01-03     paris         54.0        8.0  Cloudy
11          11  2017-01-04     paris         42.0       10.0  Cloudy

In [26]:
# to remove the index out of the dataframe and show in the results 

dataframe.to_csv('dataframe_without_index.csv', index=False)
df2=pd.read_csv('dataframe_without_index.csv')
df2

           day      city  temperature  windspeed   event
0   2017-01-01  new york         32.0        6.0    Rain
1   2017-01-02  new york         36.0        7.0   Sunny
2   2017-01-03  new york         28.0       12.0    Snow
3   2017-01-04  new york         33.0        7.0   Sunny
4   2017-01-01    mumbai         90.0        5.0   Sunny
5   2017-01-02    mumbai         85.0       12.0     Fog
6   2017-01-03    mumbai         87.0       15.0     Fog
7   2017-01-04    mumbai         92.0        5.0    Rain
8   2017-01-01     paris         45.0       20.0   Sunny
9   2017-01-02     paris         50.0       13.0  Cloudy
10  2017-01-03     paris         54.0        8.0  Cloudy
11  2017-01-04     paris         42.0       10.0  Cloudy

In [27]:
# to store the dataframe in excel install openpyxl

dataframe.to_excel('dataframe.xlsx',sheet_name='weather data')

In [ ]:
dataframe3=pd.read_csv('weather_data_cities.csv')
dataframe3

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [ ]:
# practice
dataframe3.day[dataframe3.city=='new york']

0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
Name: day, dtype: object

In [ ]:
# groupby()
c=dataframe3.groupby('city')
print(c)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x7fb6a2898a60>

In [ ]:
for city,city_df in c:
    print(city)
    print(city_df)

mumbai
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain
new york
        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
paris
         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

In [ ]:
c.get_group('new york')

        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny

In [ ]:
c.max()

               day  temperature  windspeed  event
city
mumbai    1/4/2017           92         15  Sunny
new york  1/4/2017           36         12  Sunny
paris     1/4/2017           54         20  Sunny

In [ ]:
c.min()

               day  temperature  windspeed   event
city
mumbai    1/1/2017           85          5     Fog
new york  1/1/2017           28          6    Rain
paris     1/1/2017           42          8  Cloudy

In [ ]:
c.describe()

         temperature                                                   \
               count   mean       std   min    25%   50%    75%   max
city
mumbai           4.0  88.50  3.109126  85.0  86.50  88.5  90.50  92.0
new york         4.0  32.25  3.304038  28.0  31.00  32.5  33.75  36.0
paris            4.0  47.75  5.315073  42.0  44.25  47.5  51.00  54.0

         windspeed
             count   mean       std  min   25%   50%    75%   max
city
mumbai         4.0   9.25  5.057997  5.0  5.00   8.5  12.75  15.0
new york       4.0   8.00  2.708013  6.0  6.75   7.0   8.25  12.0
paris          4.0  12.75  5.251984  8.0  9.50  11.5  14.75  20.0

In [ ]:
# creating dataframes

india_weather=pd.DataFrame({'city':['Bangalore','Mumbai','Kolkata'], 'Temperature': [32, 33, 35], 'Humidity':[60,45,34]
                           })
print(india_weather)

        city  Temperature  Humidity
0  Bangalore           32        60
1     Mumbai           33        45
2    Kolkata           35        34

In [ ]:
us_weather=pd.DataFrame({'city':['Chicago', 'Washington', 'Texas'], 'Temperature':[23, 34, 45], 
                         'Humidity':[45,56,55]})
print(us_weather)

         city  Temperature  Humidity
0     Chicago           23        45
1  Washington           34        56
2       Texas           45        55

In [ ]:
# concatenate two lists
india_us_weather_concat=pd.concat([india_weather, us_weather])
print(india_us_weather_concat)

         city  Temperature  Humidity
0   Bangalore           32        60
1      Mumbai           33        45
2     Kolkata           35        34
0     Chicago           23        45
1  Washington           34        56
2       Texas           45        55

In [ ]:
# concat and order two lists 
india_us_weather_concat=pd.concat([india_weather, us_weather], ignore_index=True)
print(india_us_weather_concat)

         city  Temperature  Humidity
0   Bangalore           32        60
1      Mumbai           33        45
2     Kolkata           35        34
3     Chicago           23        45
4  Washington           34        56
5       Texas           45        55

In [ ]:
# concatenate two dataframes row wise (axis=0)
india_us_weather_concat_rowwise=pd.concat([india_weather, us_weather], axis=0)
print(india_us_weather_concat_rowwise)

         city  Temperature  Humidity
0   Bangalore           32        60
1      Mumbai           33        45
2     Kolkata           35        34
0     Chicago           23        45
1  Washington           34        56
2       Texas           45        55

In [ ]:
temp_df=pd.DataFrame({'city':['mumbai', 'bangalore', 'kolkata'], 'temp':[32, 23, 38]})
print(temp_df)

        city  temp
0     mumbai    32
1  bangalore    23
2    kolkata    38

In [ ]:
humid_df=pd.DataFrame({'city':['ranchi','mumbai','bangalore'], 'humid':[45, 56, 67]})
print(humid_df)

        city  humid
0     ranchi     45
1     mumbai     56
2  bangalore     67

In [ ]:
df=pd.merge(temp_df,humid_df, on='city')
print(df)

        city  temp  humid
0     mumbai    32     56
1  bangalore    23     67

In [ ]:
df=pd.merge(temp_df, humid_df, on='city', how='outer')
print(df)

        city  temp  humid
0     mumbai  32.0   56.0
1  bangalore  23.0   67.0
2    kolkata  38.0    NaN
3     ranchi   NaN   45.0

In [ ]:
# manipulating index while creating a data frame
dfnum=pd.DataFrame([1,2,3,4,5], index=[100,99,98,97,96])
print(dfnum)

     0
100  1
99   2
98   3
97   4
96   5

In [ ]:
# without manipulating index creating a data frame
dfnum1=pd.DataFrame({'num':[1,2,3,4,5]}, index=[1,2,3,4,5])
print(dfnum1)

   num
1    1
2    2
3    3
4    4
5    5

In [ ]:
dfnum1.loc[2]

num    2
Name: 2, dtype: int64

In [ ]:
dfnum1.iloc[2]

num    3
Name: 3, dtype: int64

In [ ]:
print(dfnum)

     0
100  1
99   2
98   3
97   4
96   5

In [ ]:
print(dfnum.loc[100])
print(dfnum.iloc[0])

0    1
Name: 100, dtype: int64
0    1
Name: 100, dtype: int64

In [ ]:
dfnum.loc[:96]

     0
100  1
99   2
98   3
97   4
96   5

In [ ]:
dfnum.iloc[:2]

     0
100  1
99   2